# DataFrames
DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [30]:
import pandas as pd
import numpy as np

In [31]:
from numpy.random import randn

In [32]:
from numpy.random import random

In [33]:
np.random.seed(101)

In [46]:
df = pd.DataFrame(data = random((5,4)),index = "A B C D E".split(),columns = "W X Y Z".split())

In [47]:
df

          W         X         Y         Z
A  0.734819  0.541962  0.913154  0.807920
B  0.402998  0.357224  0.952877  0.343632
C  0.865100  0.830278  0.538161  0.922469
D  0.097146  0.102847  0.701507  0.890480
E  0.159560  0.275573  0.672492  0.164303

In [13]:
data = np.array([['','Col1','Col2'],
                ['Row1',1,2],
                ['Row2',3,4]])

In [15]:
data

array([['', 'Col1', 'Col2'],
       ['Row1', '1', '2'],
       ['Row2', '3', '4']], dtype='<U11')

In [7]:
data[1:,1:]

array([['1', '2'],
       ['3', '4']], dtype='<U4')

In [10]:
data[1:,0]

array(['Row1', 'Row2'], dtype='<U4')

In [16]:
df1 = pd.DataFrame(data[1:,1:],index = data[1:,0], columns = data[0,1:])

In [17]:
df1

     Col1 Col2
Row1    1    2
Row2    3    4

In [35]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [36]:
df[['W','X']] #Pass a list of columns

          W         X
A  0.516399  0.570668
B  0.685277  0.833897
C  0.721544  0.189939
D  0.181892  0.785602
E  0.083561  0.603548

In [17]:
type(df['W'])

pandas.core.series.Series

# Creating a new Column

In [37]:
df['new'] = df['X']+df['Y']

In [19]:
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.599142
B  0.685277  0.833897  0.306966  0.893613  1.140863
C  0.721544  0.189939  0.554228  0.352132  0.744167
D  0.181892  0.785602  0.965483  0.232354  1.751085
E  0.083561  0.603548  0.728993  0.276239  1.332541

In [20]:
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.599142
B  0.685277  0.833897  0.306966  0.893613  1.140863
C  0.721544  0.189939  0.554228  0.352132  0.744167
D  0.181892  0.785602  0.965483  0.232354  1.751085
E  0.083561  0.603548  0.728993  0.276239  1.332541

** **Removing Columns** **

In [21]:
df.drop('new',axis = 1)

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

** *ACtually not permanently dropped till inplace = True* **

In [24]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [22]:
df.drop('new',axis = 1,inplace = True)

In [28]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354

In [29]:
df.iloc[2]

W    0.721544
X    0.189939
Y    0.554228
Z    0.352132
Name: C, dtype: float64

In [24]:
# We can also drop rows in the above way
df.drop('E')

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [24]:
#Again, need inplace = True for permanent dropping

In [25]:
df.drop('E',inplace= True)

In [26]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354

** *Selecting Rows* **

In [31]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

**Or select based off of position instead of label**

In [27]:
df.iloc[2]

W    0.721544
X    0.189939
Y    0.554228
Z    0.352132
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [33]:
df.loc['A','W']

2.706849839399938

In [35]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

# Conditional Selection 

A very important  feature of Pandas is conditional selection, using bracket notation

In [38]:
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.599142
B  0.685277  0.833897  0.306966  0.893613  1.140863
C  0.721544  0.189939  0.554228  0.352132  0.744167
D  0.181892  0.785602  0.965483  0.232354  1.751085
E  0.083561  0.603548  0.728993  0.276239  1.332541

In [49]:
df

          W         X         Y         Z
A  0.734819  0.541962  0.913154  0.807920
B  0.402998  0.357224  0.952877  0.343632
C  0.865100  0.830278  0.538161  0.922469
D  0.097146  0.102847  0.701507  0.890480
E  0.159560  0.275573  0.672492  0.164303

In [50]:
df[df['W'] > 0.1]

          W         X         Y         Z
A  0.734819  0.541962  0.913154  0.807920
B  0.402998  0.357224  0.952877  0.343632
C  0.865100  0.830278  0.538161  0.922469
E  0.159560  0.275573  0.672492  0.164303

In [51]:
df[df['W']>0.1]['Y']

A    0.913154
B    0.952877
C    0.538161
E    0.672492
Name: Y, dtype: float64

In [42]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

**For two conditions, you can use & and | paranthesis**

In [52]:
df[(df['W'] >0.1) & (df['Y'] >0.5)]

          W         X         Y         Z
A  0.734819  0.541962  0.913154  0.807920
B  0.402998  0.357224  0.952877  0.343632
C  0.865100  0.830278  0.538161  0.922469
E  0.159560  0.275573  0.672492  0.164303

In [53]:
df

          W         X         Y         Z
A  0.734819  0.541962  0.913154  0.807920
B  0.402998  0.357224  0.952877  0.343632
C  0.865100  0.830278  0.538161  0.922469
D  0.097146  0.102847  0.701507  0.890480
E  0.159560  0.275573  0.672492  0.164303

# More Index Details
Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [54]:
df

          W         X         Y         Z
A  0.734819  0.541962  0.913154  0.807920
B  0.402998  0.357224  0.952877  0.343632
C  0.865100  0.830278  0.538161  0.922469
D  0.097146  0.102847  0.701507  0.890480
E  0.159560  0.275573  0.672492  0.164303

In [59]:
#Reset index to 0,1,2....n
df.reset_index()

  index         W         X         Y         Z States
0     A  0.734819  0.541962  0.913154  0.807920    DEL
1     B  0.402998  0.357224  0.952877  0.343632    KOL
2     C  0.865100  0.830278  0.538161  0.922469    BNG
3     D  0.097146  0.102847  0.701507  0.890480   PUNE
4     E  0.159560  0.275573  0.672492  0.164303  CHENN

In [56]:
newind = 'DEL KOL BNG PUNE CHENN'.split()

In [57]:
df['States'] = newind

In [58]:
df

          W         X         Y         Z States
A  0.734819  0.541962  0.913154  0.807920    DEL
B  0.402998  0.357224  0.952877  0.343632    KOL
C  0.865100  0.830278  0.538161  0.922469    BNG
D  0.097146  0.102847  0.701507  0.890480   PUNE
E  0.159560  0.275573  0.672492  0.164303  CHENN

In [60]:
df.set_index('States',inplace = True)

In [61]:
df

               W         X         Y         Z
States
DEL     0.734819  0.541962  0.913154  0.807920
KOL     0.402998  0.357224  0.952877  0.343632
BNG     0.865100  0.830278  0.538161  0.922469
PUNE    0.097146  0.102847  0.701507  0.890480
CHENN   0.159560  0.275573  0.672492  0.164303

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [47]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [48]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [49]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [52]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [53]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index, columns = ['A','B'])

In [54]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [55]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [56]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [57]:
#CrossSection
df.xs('G1')

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [27]:
#Cross Section at G1,Level 1

df.xs(['G1',1])

A   -0.703339
B    0.787942
Name: (G1, 1), dtype: float64

In [31]:
df.index.names

FrozenList([None, None])

In [58]:
df.index.names = ['Group','Name']

In [59]:
df

                   A         B
Group Name
G1    1     0.302665  1.693723
      2    -1.706086 -1.159119
      3    -0.134841  0.390528
G2    1     0.166905  0.184502
      2     0.807706  0.072960
      3     0.638787  0.329646

In [34]:
df.xs(1,level = 'Name')

              A         B
Group
G1    -0.703339  0.787942
G2    -0.324908  0.231725

**Great Job**